# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+Title:  \scalebox{.95}{Reproducibility Crisis, Open Science, and Computer Science}
#+Author: Arnaud Legrand\medskip\newline\logoInstitutions
#+DATE:  \vspace{1cm}\JDEVlogo October 2020\hfill \mylogo\vspace{-1.3cm}
#+LANGUAGE: en
#+STARTUP: beamer indent inlineimages logdrawer
#+TAGS: noexport(n)

#+PROPERTY: header-args  :session :eval never-export :exports both
#+DRAWERS: latex_headers

:latex_headers:
#+LaTeX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt,aspectratio=169,presentation,xcolor={usenames,dvipsnames,svgnames,table}]
#+OPTIONS:   H:2 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_COMPILER: lualatex -shell-escape
#+LATEX_HEADER: \usedescriptionitemofwidthas{bl}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage{figlatex}
#+LATEX_HEADER: \usepackage[french]{babel}
#+LATEX_HEADER: %\usepackage{DejaVuSansMono}
#+LATEX_HEADER: \usepackage{ifthen,amsmath,amstext,gensymb,amssymb}
#+LATEX_HEADER: \usepackage{boxedminipage,xspace,multicol}
#+LATEX_HEADER: %%%%%%%%% Begin of Beamer Layout %%%%%%%%%%%%%
#+LATEX_HEADER: \ProcessOptionsBeamer
#+LATEX_HEADER: \usetheme[numbering=fraction,titleformat=smallcaps,progressbar=frametitle]{metropolis}
#+LATEX_HEADER: \usepackage{fontawesome}
#+LATEX_HEADER: \usecolortheme[named=BrickRed]{structure}
#+LATEX_HEADER: %%%%%%%%% End of Beamer Layout %%%%%%%%%%%%%
#+LATEX_HEADER: \usepackage{verbments}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{url} \urlstyle{sf}
#+LATEX_HEADER: \let\alert=\structure % to make sure the org * * works of tools
#+LATEX_HEADER: %\let\tmptableofcontents=\tableofcontents
#+LATEX_HEADER: %\def\tableofcontents{}
#+LATEX_HEADER: \let\hrefold=\href
#+LATEX_HEADER: \let\oldtexttt=\texttt
#+LATEX_HEADER: \usepackage{ifluatex}
#+LATEX_HEADER: \ifpdftex
#+LATEX_HEADER:   \usepackage[normalem]{ulem}\usepackage{soul}
*** R code                                                       :noexport:
#+begin_src shell :results output :exports both
wget https://www.autodeskresearch.com/sites/default/files/The%20Datasaurus%20Dozen.zip -O datasaurus.zip
unzip -f datasaurus.zip
# cat The\ Datasaurus\ Dozen/DatasaurusDozen.tsv | sed 's/  */,/g' > datasaurus.csv
#+end_src

#+RESULTS:
: Archive:  datasaurus.zip

#+begin_src R :results output graphics :file pdf_babel/datasaurus.pdf :exports both :width 10 :height 7 :session *R* 
library(ggplot2)
library(ggpubr)

df = read.table(file = 'The Datasaurus Dozen/DatasaurusDozen.tsv', sep = '\t', header = TRUE)
ggplot(df[df$dataset != "v_lines",], aes(x=x,y=y)) + geom_point(size=.5) + 
    stat_cor(method = "pearson", label.y = -10) + # , , label.y = 30
    facet_wrap(~dataset) + theme_bw()
#+end_src

#+RESULTS:
[[file:pdf_babel/datasaurus.pdf]]

#+begin_src R :results output :session *R* :exports both
library(dplyr)
df %>% group_by(dataset) %>% summarize(correlation = cor(x, y))
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 13 x 2
   dataset    correlation
   <fct>            <dbl>
 1 away           -0.0641
 2 bullseye       -0.0686
 3 circle         -0.0683
 4 dino           -0.0645
 5 dots           -0.0603
 6 h_lines        -0.0617
 7 high_lines     -0.0685
 8 slant_down     -0.0690
 9 slant_up       -0.0686
10 star           -0.0630
11 v_lines        -0.0694
12 wide_lines     -0.0666
13 x_shape        -0.0656
#+end_example

